app/controllers/audio_notes_controller.rb

SELECT "audio_notes".* FROM "audio_notes"
---
  def index
    @audio_notes = AudioNote.all

INSERT INTO "audio_notes" ("created_at", "notebook_id", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-23 08:40:20.406874"], ["notebook_id", 1], ["title", "bazz"], ["updated_at", "2014-11-23 08:40:20.406874"], ["url", "http://soundcloud.com/okayinder/untitled-recording-4"]]
---
  def create
    @audio_note = AudioNote.new(audio_note_params)
    @audio_note.save

SELECT  "audio_notes".* FROM "audio_notes"  WHERE "audio_notes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_audio_note
      @audio_note = AudioNote.find(params[:id])