app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("content", "created_at", "notebook_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "notebook first da note pehla"], ["created_at", "2014-10-15 20:05:37.287214"], ["notebook_id", 1], ["title", "nb1n1"], ["updated_at", "2014-10-15 20:05:37.287214"]]