app/controllers/notebooks_controller.rb

  def index
    @notebooks = Notebook.all
---
SELECT "notebooks".* FROM "notebooks"

  def show
    @singleNotebook = Notebook.find(params[:id])
---
SELECT  "notebooks".* FROM "notebooks"  WHERE "notebooks"."id" = ? LIMIT 1  [["id", 1]]

  def notes
    @singleNotebook = Notebook.find(params[:id])
---
SELECT  "notebooks".* FROM "notebooks"  WHERE "notebooks"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @notebook = Notebook.new(notebook_params)

    respond_to do |format|
      if @notebook.save
---
INSERT INTO "notebooks" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-15 19:58:23.736106"], ["description", "just another notebook, you know."], ["name", "notebook-1"], ["updated_at", "2014-10-15 19:58:23.736106"]]

  def destroy
    @notebook.destroy
---
DELETE FROM "notebooks" WHERE "notebooks"."id" = ?  [["id", 3]]

    def set_notebook
      @notebook = Notebook.find(params[:id])
---
SELECT  "notebooks".* FROM "notebooks"  WHERE "notebooks"."id" = ? LIMIT 1  [["id", 3]]