app/controllers/schedules_controller.rb

  def create
    @schedule = Schedule.new(schedule_params)
    @schedule.save
---
INSERT INTO "schedules" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-02 09:57:36.632160"], ["title", ""], ["updated_at", "2014-12-02 09:57:36.632160"]]