app/controllers/timetables_controller.rb

SELECT "timetables".* FROM "timetables"
---
  def index
    @timetables = Timetable.all

INSERT INTO "timetables" ("created_at", "name", "time", "updated_at", "work") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-17 08:32:55.670959"], ["name", "sunday"], ["time", "10 am "], ["updated_at", "2014-11-17 08:32:55.670959"], ["work", "project start"]]
---
  def create
    @timetable = Timetable.new(timetable_params)
    @timetable.save

SELECT  "timetables".* FROM "timetables"  WHERE "timetables"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_timetable
      @timetable = Timetable.find(params[:id])